# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [2]:
cur.execute("""SELECT lastName, firstName, city
               FROM employees
               JOIN offices
               USING(officeCode)
               WHERE city = 'Boston';""")
boston_emp = pd.DataFrame(cur.fetchall())
boston_emp.columns = [x[0] for x in cur.description]
boston_emp

    lastName firstName    city
0   Firrelli     Julie  Boston
1  Patterson     Steve  Boston

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [8]:
cur.execute("""SELECT city, COUNT(*)
               FROM offices
               LEFT JOIN employees
               USING(officeCode)
               GROUP BY city;""")
count_emp = pd.DataFrame(cur.fetchall())
count_emp.columns = [x[0] for x in cur.description]
count_emp

            city  COUNT(*)
0         Boston         2
1         London         2
2            NYC         2
3          Paris         5
4  San Francisco         6
5         Sydney         4
6          Tokyo         2

## Write 3 Questions of your own and answer them

In [8]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [10]:
# Find the top 5 customers by average order amount
cur.execute("""SELECT customerName, AVG(amount) AS avg_order
               FROM customers
               JOIN payments
               USING(customerNumber)
               GROUP BY customerName
               ORDER BY avg_order DESC
               LIMIT 5;""")
cust_avg = pd.DataFrame(cur.fetchall())
cust_avg.columns = [x[0] for x in cur.description]
cust_avg

                   customerName     avg_order
0  Collectable Mini Designs Co.  80375.240000
1      Corporate Gift Ideas Co.  66170.390000
2  Mini Gifts Distributors Ltd.  64909.804444
3     The Sharp Gifts Warehouse  59551.380000
4        Euro+ Shopping Channel  55056.844615

In [17]:
# Sort product lines by average MSRP
cur.execute("""SELECT productLine, AVG(MSRP) AS avg_msrp
               FROM productlines
               JOIN products
               USING(productLine)
               GROUP BY productLine
               ORDER BY avg_msrp DESC;""")
line_avg = pd.DataFrame(cur.fetchall())
line_avg.columns = [x[0] for x in cur.description]
line_avg

        productLine    avg_msrp
0      Classic Cars  118.021053
1  Trucks and Buses  103.183636
2       Motorcycles   97.178462
3            Planes   89.515833
4      Vintage Cars   87.095833
5             Ships   86.563333
6            Trains   73.853333

In [19]:
# Find out how many items were ordered from each vendor
cur.execute("""SELECT productVendor, SUM(quantityOrdered) AS items
               FROM products
               JOIN orderdetails
               USING(productCode)
               GROUP BY productVendor
               ORDER BY items DESC;""")
vendor_items = pd.DataFrame(cur.fetchall())
vendor_items.columns = [x[0] for x in cur.description]
vendor_items

                productVendor  items
0     Classic Metal Creations   9678
1     Motor City Art Classics   8873
2    Carousel DieCast Legends   8735
3               Exoto Designs   8604
4        Unimax Art Galleries   8439
5        Gearbox Collectibles   8352
6         Second Gear Diecast   7845
7    Highway 66 Mini Classics   7808
8             Min Lin Diecast   7729
9       Autoart Studio Design   7702
10  Welly Diecast Productions   7580
11        Studio M Art Models   7552
12          Red Start Diecast   6619

## Level Up: Display the names of every individual product that each employee has sold

In [26]:
cur.execute("""SELECT employeeNumber, productName
               FROM employees e
               JOIN customers c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               JOIN orders
               USING(customerNumber)
               JOIN orderdetails
               USING(orderNumber)
               JOIN products
               USING(productCode);""")
emp_items = pd.DataFrame(cur.fetchall())
emp_items.columns = [x[0] for x in cur.description]
emp_items.head(20)

   employeeNumber                                  productName
0            1165                               1958 Setra Bus
1            1165                       1940 Ford Pickup Truck
2            1165                      1939 Cadillac Limousine
3            1165  1996 Peterbilt 379 Stake Bed with Outrigger
4            1165                            1968 Ford Mustang
5            1165                           1968 Dodge Charger
6            1165                      1970 Plymouth Hemi Cuda
7            1165                           1969 Dodge Charger
8            1165                  1948 Porsche 356-A Roadster
9            1165                         1969 Dodge Super Bee
10           1165                        1976 Ford Gran Torino
11           1165                             1957 Vespa GS150
12           1165                    1957 Corvette Convertible
13           1165                      1982 Ducati 900 Monster
14           1165                      1982 Lamborghini Diablo
15           1165                    1971 Alpine Renault 1600s
16           1165                      1956 Porsche 356A Coupe
17           1165                        1961 Chevrolet Impala
18           1165                            1982 Ducati 996 R
19           1165                    1974 Ducati 350 Mk3 Desmo

## Level Up: Display the Number of Products each employee has sold

In [31]:
cur.execute("""SELECT employeeNumber, SUM(quantityOrdered) as count
               FROM employees e
               JOIN customers c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               JOIN orders
               USING(customerNumber)
               JOIN orderdetails
               USING(orderNumber)
               GROUP BY employeeNumber;""")
emp_items = pd.DataFrame(cur.fetchall())
emp_items.columns = [x[0] for x in cur.description]
emp_items

   employeeNumber  count
0            1165  11854
1            1166   4056
2            1188   4227
3            1216   5561
4            1286   5016
5            1323   7423
6            1337   6186
7            1370  14231
8            1401   9290
9            1501   8205
10           1504   7486
11           1611   6246
12           1612   6632
13           1621   4923
14           1702   4180

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!